firstroutesandcontrollers/app/controllers/artworks_controller.rb

  def update
    @artwork = Artwork.find(params[:id])
    @artwork.update!(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Alvin"], ["updated_at", "2023-02-16 20:39:02.884514"], ["id", 7]]

  def destroy
    @artwork = Artwork.find(params[:id])
    @artwork.delete
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 8]]