firstroutesandcontrollers/app/controllers/artwork_shares_controller.rb

    def create
        # debugger
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 49], ["viewer_id", 71], ["created_at", "2023-02-16 22:22:50.157968"], ["updated_at", "2023-02-16 22:22:50.157968"]]