firstroutesandcontrollers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Steven"], ["email", "notovitz@gmail.com"], ["updated_at", "2023-02-16 16:45:28.965133"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        @user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        @user = User.find(params[:id])
        @user.delete